Autodesk.Revit.Creation.ItemFactoryBase.PlaceGroup(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.GroupType)
Place an instance of a Model Group into the Autodesk Revit document, using a location
and a group type.
location: The physical location where the group is to be placed.
groupType: A GroupType object that represents the type of group that is to be placed.
Returns: If creation was successful then an instance to the new group is returned, otherwise null.
Remarks: This method is used to place a new instance of an existing group type within the document.
The group's origin will placed at the point specified by the location. All group types within the
document can be found by iterating over the document and looking for elements of type
Autodesk.Revit.Symbols.GroupType.

Autodesk.Revit.Creation.ItemFactoryBase.NewTextNote(Autodesk.Revit.DB.View,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Double,Autodesk.Revit.DB.TextAlignFlags,Autodesk.Revit.DB.TextNoteLeaderTypes,Autodesk.Revit.DB.TextNoteLeaderStyles,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.String)
Creates a new text note with a single leader.
pView: The view where the text note object will be visible.
origin: The origin of the text note.
baseVec: The horizontal direction for text in the text note.
upVec: The vertical direction for text in the text note.
lineWidth: The width of the rectangle bounding the note text.
textAlign:  Flags indicating the alignment of the note.
This should be a bitwise OR including one of TEF_ALIGN_TOP, TEF_ALIGN_MIDDLE and TEF_ALIGN_BOTTOM and one of TEF_ALIGN_LEFT, TEF_ALIGN_CENTER and TEF_ALIGN_RIGHT.
The defaults for this flag are TEF_ALIGN_TOP | TEF_ALIGN_LEFT.
leaderType:  The type and alignment of the leader for the note.
leaderStyle:  The style of the leader for the note.
leaderEnd:  The end point for the leader.
leaderElbow:  The elbow point for the leader.
strText:  Text to display in the text note.
Include new line characters to force a multiple line note to be created.
Notes may also wrap automatically based on the width of the note rectangle.
Returns:  If successful, a TextNote object is returned.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when (1) Any one of pView, origin, baseVec, upVec, strText is null.
(2)leaderEnd is null when leaderStyle != Autodesk::Revit::DB::TextNoteLeaderStyles::LCS_NONE.
(3)leaderElbow is null when leaderStyle == Autodesk::Revit::DB::TextNoteLeaderStyles::LCS_TWO_SEG_LINE.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when lineWidth is not a finite number.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when (1) textAlign is not a valid Autodesk.Revit.DB.TextAlignFlags
or it is not a valid bitwise OR of Autodesk.Revit.DB.TextAlignFlags.
(2) leaderStyle is not a valid Autodesk.Revit.DB.TextNoteLeaderTypes
or leaderType is not a valid Autodesk.Revit.DB.TextNoteLeaderTypes
when leaderStyle != Autodesk::Revit::DB::TextNoteLeaderStyles::LCS_NONE
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the regeneration fails when creating the text note.

Autodesk.Revit.Creation.ItemFactoryBase.NewTextNote(Autodesk.Revit.DB.View,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Double,Autodesk.Revit.DB.TextAlignFlags,System.String)
Creates a new TextNote object.
Creates a new TextNote object without a leader.
pView: The view where the text note object will be visible.
origin: The origin of the text note.
baseVec: The horizontal direction for text in the text note.
upVec: The vertical direction for text in the text note.
lineWidth: The width of the rectangle bounding the note text.
textAlign:  Flags indicating the alignment of the note.
This should be a bitwise OR including one of TEF_ALIGN_TOP, TEF_ALIGN_MIDDLE and TEF_ALIGN_BOTTOM and one of TEF_ALIGN_LEFT, TEF_ALIGN_CENTER and TEF_ALIGN_RIGHT.
The defaults for this flag are TEF_ALIGN_TOP | TEF_ALIGN_LEFT.
strText:  Text to display in the text note.
Include new line characters to force a multiple line note to be created.
Notes may also wrap automatically based on the width of the note rectangle.
Returns:  If successful, a TextNote object is returned.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when any one of pView, origin, baseVec, upVec, strText is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input lineWidth is not a finite number.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the input textAlign is not a valid Autodesk.Revit.DB.TextAlignFlags or it is not a valid bitwise OR of the align flags.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the regeneration fails when creating the text note.

Autodesk.Revit.Creation.ItemFactoryBase.NewLevel(System.Double)
Creates a new level.
elevation:  The elevation to apply to the new level.
Returns:  The newly created level.
Remarks:  Default level attributes will apply to this new model.

Autodesk.Revit.Creation.ItemFactoryBase.NewGroup(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Creates a new type of group.
elementIds: A set of elements which will be made into the new group.
Returns: A new instance of a group containing the elements specified.
Remarks:
The new group may contain more members than just the set input to this method.  Elements
which are closely connected with the inputs (such as sketch and sketch plane) will also be added to
the group.
Initially the group will have a generic name, such as Group 1. This can be changed by
changing the name of the group type as follows: newGroup.GroupType.Name = newName.
If a newly-created element is being added to a group, calling document.Regenerate() may be needed to avoid
a warning visible in the UI that the group has changed outside group edit mode.

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstances2(System.Collections.Generic.List`1{Autodesk.Revit.Creation.FamilyInstanceCreationData})
Creates Family instances within the document.
dataList:  A list of FamilyInstanceCreationData which wraps the creation arguments of the families to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: If FamilyInstanceCreationData's 'curve' or 'symbol' member is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If regeneration fails at the end of the batch creation.
Returns:  If the creation is successful, a set of ElementIds which contains the Family instances should be returned, otherwise the exception will be thrown.
Remarks:
Note: ForbiddenForDynamicUpdateException might be thrown during a dynamic update if the inserted instance establishes a mutual dependency with another structure.
Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstance(Autodesk.Revit.DB.Line,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.View)
Add a line based detail family instance into the Autodesk Revit document,
using an line and a view where the instance should be placed.
line: The line location of family instance. The line must in the plane of the view.
symbol: A family symbol object that represents the type of the instance that is to be inserted.
specView: A 2D view in which to display the family instance.
Remarks: This overload applies only to 2D family line based detail symbols.
The type/symbol that is used must be loaded into the document before this method is called.
Families and their symbols can be loaded using the Document.LoadFamily
or Document.LoadFamilySymbol methods.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when input argument line or symbol or specView is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when input argument line or symbol or specView is invalid,
or cannot make such type in the specView,
or the line is not in the plane of specView.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when failed to create the instance.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when attempting to place a model-based family.  Only 2D detail families can be placed in views.

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstance(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.View)
Add a new family instance into the Autodesk Revit document,
using an origin and a view where the instance should be placed.
origin: The origin of family instance. If created on a Autodesk.Revit.DB.ViewPlan,
the origin will be projected onto the Autodesk.Revit.DB.ViewPlan.
symbol: A family symbol object that represents the type of the instance that is to be inserted.
specView: The 2D view in which to place the family instance.
Returns: If creation was successful then an instance to the new object is returned.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: One or more required arguments was null
Throws Autodesk.Revit.Exceptions.ArgumentException: The input family PlacementType was not ViewBased, the input view was not 2D,
or instances of the input FamilySymbol are not permitted on a view of this type.
Remarks: This overload applies only to 2D family symbols (detail components, annotation symbols, titleblocks, etc.).
The type/symbol that is used must be loaded into the document before this method is called.
Families and their symbols can be loaded using the Document.LoadFamily or Document.LoadFamilySymbol methods.

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstance(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.FamilySymbol)
Inserts a new instance of a family onto a face referenced by the input Reference instance,
using a line on that face for its position, and a type/symbol.
reference: A reference to a face.
position: A line on the face defining where the symbol is to be placed.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
Note that this symbol must represent a family whose Autodesk.Revit.DB.Family.FamilyPlacementType
is WorkPlaneBased or CurveBased.
Returns: An instance of the new object if creation was successful, otherwise null.
Remarks: Use this method to insert one family instance on a face of another element,
using a line on the face to define the position and direction of the new symbol.
The type/symbol that is used must be loaded into the document before this method
is called. Families and their symbols can be loaded using the Document.LoadFamily or
Document.LoadFamilySymbol methods.The host object must support insertion of instances, otherwise this method
will fail. If the instance fails to be created an exception may be thrown.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when a non-optional argument was null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the function
cannot get a face from the reference, or, when the family
cannot be placed as line-based on an input face reference, because its FamilyPlacementType is not WorkPlaneBased or
CurveBased
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException: Thrown when the family cannot be placed on
this line as it does not coincide with the input face.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when Revit is unable to place the family
instance.

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstance(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol)
Inserts a new instance of a family onto a face referenced by the input Reference instance,
using a location, reference direction, and a type/symbol.
reference: A reference to a face.
location: Point on the face where the instance is to be placed.
referenceDirection: A vector that defines the direction of the family instance.
Note that this direction defines the rotation of the instance on the face, and thus cannot be parallel
to the face normal.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
Note that this symbol must represent a family whose Autodesk.Revit.DB.Family.FamilyPlacementType
is WorkPlaneBased.
Returns: An instance of the new object if creation was successful, otherwise null.
Remarks: Use this method to insert one family instance on a face of another element,
using a point on the face and a vector to define the position and direction of the new symbol.
The type/symbol that is used must be loaded into the document before this method is called.
Families and their symbols can be loaded using the Document.LoadFamily or
Document.LoadFamilySymbol methods.The host object must support insertion of instances, otherwise this method
will fail. If the instances fails to be created an exception may be thrown.Some Families, such as Beams, have more than one endpoint and are inserted
in the same manner as single point instances. Once inserted, these linear family instances
can have their endpoints changed by using the instance's Element.Location property.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when a non-optional argument was null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the function cannot get the face from
the reference, or, when the Family cannot be placed as line-based on an input face reference, because its FamilyPlacementType
is not WorkPlaneBased
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException: Thrown when reference direction is
parallel to face normal at insertion point.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when Revit is unable to place the family
instance.

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstance(Autodesk.Revit.DB.Face,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.FamilySymbol)
Inserts a new instance of a family onto a face of an existing element,
using a line on that face for its position, and a type/symbol.
face: A face of a geometry object.
position: A line on the face defining where the symbol is to be placed.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
Note that this symbol must represent a family whose Autodesk.Revit.DB.Family.FamilyPlacementType
is WorkPlaneBased or CurveBased.
Returns: An instance of the new object if creation was successful, otherwise null.
Remarks: Use this method to insert one family instance on a face of another element,
using a line on the face to define the position and direction of the new symbol.
The type/symbol that is used must be loaded into the document before this method
is called. Families and their symbols can be loaded using the Document.LoadFamily or
Document.LoadFamilySymbol methods.The host object must support insertion of instances, otherwise this method
will fail. If the instance fails to be created an exception may be thrown.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when a non-optional argument was null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the function cannot get the Reference
from the face, or, Family cannot be placed as line-based on an input face reference, because its FamilyPlacementType
is not WorkPlaneBased or CurveBased
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException: Thrown when the family cannot be placed on
this line as it does not coincide with the input face.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when Revit is unable to place the family
instance.

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstance(Autodesk.Revit.DB.Face,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol)
Inserts a new instance of a family onto a face of an existing element,
using a location, reference direction, and a type/symbol.
face: A face of a geometry object.
location: Point on the face where the instance is to be placed.
referenceDirection: A vector that defines the direction of the family instance.
Note that this direction defines the rotation of the instance on the face, and thus cannot be parallel
to the face normal.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
Note that this symbol must represent a family whose Autodesk.Revit.DB.Family.FamilyPlacementType
is WorkPlaneBased.
Returns: An instance of the new object if creation was successful, otherwise null.
Remarks: Use this method to insert one family instance on a face of another element,
using a point on the face and a vector to define the position and direction of the new symbol.
The type/symbol that is used must be loaded into the document before this method is called.
Families and their symbols can be loaded using the Document.LoadFamily or
Document.LoadFamilySymbol methods.The host object must support insertion of instances, otherwise this method
will fail. If the instances fails to be created an exception may be thrown.Some Families, such as Beams, have more than one endpoint and are inserted
in the same manner as single point instances. Once inserted, these linear family instances
can have their endpoints changed by using the instance's Element.Location property.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when a non-optional argument was null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the function cannot get the Reference
from the face, or, when the Family cannot be placed as line-based on an input face reference, because its FamilyPlacementType
is not WorkPlaneBased
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException: Thrown when reference direction is
parallel to face normal at insertion point.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when Revit is unable to place the family
instance.

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstance(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Structure.StructuralType)
Inserts a new instance of a family into the document, using a location and a
type/symbol.
location: The physical location where the instance is to be placed.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
structuralType:  If structural then specify the type of the component.
Returns: If creation was successful then an instance to the new object is returned, otherwise null.
Remarks: Use this method to insert a family instance that does not require a host element or level.
The type/symbol that is used must be loaded into the document before this method is called.
Families and their symbols can be loaded using the Document.LoadFamily or
Document.LoadFamilySymbol methods.Some Families, such as Beams, have more than one endpoint
and are inserted in the same manner as single point instances. Once inserted these linear family
instances can have their endpoints changed by using the instance's Element.Location property.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstance(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Structure.StructuralType)
Inserts a new instance of a family into the document,
using a location, type/symbol, and the host element.
location: The physical location where the instance is to be placed.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
host: The object into which the FamilyInstance is to be inserted, often known as the host.
structuralType:  If structural then specify the type of the component.
Returns: If creation was successful then an instance to the new object is returned, otherwise null.
Remarks: This method is used to insert one family instance into another element, such as inserting a
window into a wall. If the instance fails to be created an exception may be thrown.
The type/symbol that is used must be loaded into the document
before this method is called. Families and their symbols can be loaded using the Document.LoadFamily
or Document.LoadFamilySymbol methods. The host object must be one that supports insertion of
instances otherwise this method will fail. Some Families, such as Beams, have more than one endpoint
and are inserted in the same manner as single point instances. Once inserted these linear family
instances can have their endpoints changed by using the instance's Element.Location property.Note: ForbiddenForDynamicUpdateException might be thrown during a dynamic update if the inserted instance establishes a mutual dependency with another structure.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstance(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Structure.StructuralType)
Inserts a new instance of a family into the document.
Inserts a new instance of a family into the document,
using a location, type/symbol, the host element and a reference direction.
location: The physical location where the instance is to be placed.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
referenceDirection:  A vector that dictates the direction of certain family instances.
host:  A host object into which the instance will be embedded
structuralType:  If structural then specify the type of the component.
Returns: If creation was successful then an instance to the new object is returned, otherwise null.
Remarks: This method allows you to create FamilyInstance objects that require both a location and direction.
If the instance fails to be created an exception may be thrown.
The type/symbol that is used must be loaded into the document
before this method is called. Families and their symbols can be loaded using the Document.LoadFamily
or Document.LoadFamilySymbol methods. Some Families, such as Beams, have more than one endpoint and
are inserted in the same manner as single point instances. Once inserted these linear family instances
can have their endpoints changed by using the instance's Element.Location property.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.